content-org/all-posts.org
#+CREATOR: Emacs 26.3 (Org mode 9.1.9 + ox-hugo)
#+HUGO_BASE_DIR: ../
#+hugo_weight: auto

** Writing Posts in Org using Ox-Hugo                                      :hugo:org:tools:Emacs:
:PROPERTIES:
:EXPORT_HUGO_SECTION: post
:EXPORT_FILE_NAME: test
:EXPORT_DATE: 2019-10-13
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :summary Writing hugo post in Emacs org.
:END:

I use  [[https://www.gnu.org/software/emacs/emacs.html][Emacs]] for almost everything I do with my laptop, such as note-taking, GTD, email-checking, coding
and writing. In previous posts, I introduced some packages and my workflow in Emacs for $\LaTeX$,
bibolography management and some usages Emacs as an alternative to Rstudio. In this post,
I will show how to write posts in my website in org with Hugo.

*** Hugo and ox-hugo
This website is built using [[https://gohugo.io/][Hugo]] with the [[https://themes.gohugo.io/academic/][Academic Theme]]. I use [[https://ox-hugo.scripter.co/][ox-hugo]], a org exporter backend that exports Org to Hugo-compatible Markdown. To use ox-hugo,
I add the following lines in the my configuration [fn:: In my case =init-local.el=, as I use the configuration by [[https://github.com/purcell/emacs.d][Purcell]].].

